---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeCreaseArrayIterator
source: html/2a53a3d2-f3cc-3848-12dc-dd066e8a1309.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArrayIterator

An iterator to an array of creases used for Slab Shape Editing.

## Syntax (C#)
```csharp
public abstract class SlabShapeCreaseArrayIterator : APIObject,
	IEnumerator
```